from random import randrange, sample

class NameGenerator:
    prefixs = {'파인', '이클래스', '심온', '다온', '탑', '화이트', '그레이스', '빈센트', '원진', '오케이', '다인', '프라임', '을지', '에이스', '그랑', '큐원', '라임',
         '바닐라', '에버엠', '아이비', '다솜', '루덴', '밀레니엄', '아너스', '퍼스트', '봄', '예담', '메이플', '보스톤', '클리오', '벨', '예담', '지앤미', '단아',
         '세실', '메트로', '더블유', '신도', '신도', '아이리스', '휴먼', '세명', '스페이스', '로벤', '홀리', '벨리', '벨라', '맥스', '유안'}
    postfixs = {'파트너스', '홀딩스', '플레이어', '컴퍼니', '코리아', '리테일', '컨세션', '마켓',
                     '마트', '텍', '테크', '컨설팅', '메디', '메디컬', '캐미컬', '개러지', '데이', '커스텀', '코퍼레이션', '생활건강', '이노'}

    last_name = {'김', '이', '박', '최', '정', '강', '조', '윤', '장', '임', '한', '오', '서', '신', '권', '황', '안', '송', '전', '홍',
                 '유', '고', '문', '양', '손', '배', '조', '백', '허', '유', '남', '심', '노', '정', '하', '곽'}
    first_name = {'이준', '서준', '하준', '도윤', '은우', '시우', '지호', '예준', '유준', '수호', '선우', '로운', '이안', '주원', '민준', '준우', '건우',
                  '연우', '도현', '우주', '윤우', '시윤', '우진', '서진', '도하', '이든', '지후', '서우', '지안', '이현', '준서', '지한', '현우', '은호',
                  '태오', '다온', '지훈', '정우', '하온', '한결', '하진', '지우', '시온', '라온', '유찬', '하민', '도겸', '율', '도율', '진우', '로이',
                  '단우', '재윤', '이한', '지오', '승우', '주안', '태윤', '시후', '시안', '민재', '시현', '우빈', '유안', '준', '하율', '수현', '지환',
                  '재하', '윤재', '서호', '하람', '지민', '도경', '윤호', '로건', '재이', '시원', '서후', '주호', '도준', '지율', '윤', '현준', '선호',
                  '은찬', '하랑', '지원', '시율', '하늘', '아인', '건', '태양', '태하', '유건', '도훈', '온유', '태율', '시완', '도원', '민호', '하성',
                  '현', '민찬', '유담', '서율', '해준', '강민', '재원', '아준', '시환', '도영', '준희', '태민', '민우', '시훈', '정후', '승현', '규빈',
                  '서한', '찬율', '도빈', '채민', '성윤', '은준', '한별', '민서', '강현', '강준', '하빈', '건하', '모건', '혜성', '한솔', '주하', '찬우',
                  '찬희', '가람', '시헌', '도연', '원준', '해든', '성민', '이재', '은후', '현진', '예담', '단', '이건', '윤준', '태겸', '경민', '은수',
                  '솔', '준성', '재훈', '서윤', '태훈', '진', '상윤', '해성', '겸', '은재', '효준', '우성', '현호', '여준', '재우', '태우', '로빈',
                  '현수', '루이', '제이', '영준', '민기', '재영', '예건', '호연', '다겸', '강', '채운', '하담', '강윤', '도담', '승유', '승후', '리온',
                  '수민', '유빈', '태온', '유호', '태영', '진서', '정윤', '정빈', '준이', '다니엘', '연후', '해온', '하겸', '요한', '민', '윤서', '로아',
                  '승찬', '로윤', '다율', '동우', '훈', '이솔', '현빈', '담', '지용', '도헌', '윤수', '유겸', '혜준', '재호', '근우', '현성', '정훈',
                  '하임', '제하', '레오', '태원', '승연', '연재', '규진', '태희', '담호', '종현', '승환', '준석', '한준', '든', '이겸', '상현', '우솔',
                  '우리', '도균', '휘', '기범', '예온', '형준', '다호', '주형', '채호', '세온', '경준', '태빈', '세민', '민승', '선재', '은유', '호영',
                  '이레', '세훈', '선', '도한', '로원', '주찬', '은오', '이삭', '서훈', '도', '도은', '우림', '유승', '성원', '시진', '준범', '찬빈',
                  '선후', '호', '루하', '도언', '준휘', '안', '시영', '태유', '신', '주언', '도아', '테오', '시운', '민국', '석현', '지유', '다빈',
                  '진후', '영민', '태서', '한겸', '정호', '진영', '도형', '이름', '이름', '서아', '하윤', '이서', '지안', '지아', '서윤', '아린', '아윤',
                  '하린', '하은', '지우', '시아', '지유', '수아', '나은', '서하', '서연', '서우', '유나', '하율', '유주', '예나', '채아', '소율', '채원',
                  '예린', '서현', '다은', '다인', '로아', '소윤', '윤서', '태리', '나윤', '소이', '리아', '아인', '재이', '윤아', '예서', '민서', '유하',
                  '채은', '주아', '채윤', '다온', '지윤', '세아', '서율', '하연', '채이', '지율', '서은', '은서', '다윤', '소은', '이나', '시은', '예은',
                  '도아', '다연', '다현', '연우', '연서', '윤슬', '소민', '예원', '채린', '하영', '봄', '유진', '사랑', '지민', '루아', '설아', '지온',
                  '시하', '리하', '서원', '하이', '우주', '도이', '고은', '세연', '은솔', '유정', '서이', '서인', '하빈', '채민', '유라', '소현', '소유',
                  '누리'}

    product_names = {
        '고속 스마트폰 무선 충전기','정리함','기계식 키보드 모델1','액체 모기향','스피커','가는 치실','KF94마스크 100개','기저귀 A형 60개','미세모 칫솔 세트','무선 청소기','방향제 C형','알람시계 AB','101키 키보드 스킨','탁구화','탁구공','손거울','그루밍 킷','온습도계 ','텀블러 500밀리','게임 패드','버티컬 무선 마우스','마이크 거치대','지향성 마이크','24인치 모니터','7부 남성 반바지','여성 청바지','반팔','잠옷 바지','잠옷 세트','치간 칫솔','5x5 큐브','굴비 50마리 셋트','사과 1박스','배즙 50개','퓨어 핸즈 에탄올 60%','살균 소독제 1L','스마트 홈 카메라','디지털 탕 온도계','유기농 산양분유 1단계 800g','스마트 자동분유제조기','코비드 19 홈 테스트','백라면 매운맛 5개','백미노트 22 Pro 5G',
        '오트밀 1.2kg','젖병 세정제 450ml','국탕용 어묵 종합','디데이 달력','캐주얼 반바지 회색','무선 구강 세정기','스판 요가 팬츠 L','유기농 초코크런치 400g','클랜징 폼 거품 제조 용기','햇 양파 1.2kg','햇감자 1kg','손질 오징어 3마리','깐마늘 300g 1봉','콩나물 500g 1봉','호주산 모듬 다짐육','국물용팩 300g','참기름 430ml','케틀벨 4kg','PC 본체 케이스 블랙','사파리 모자','책상 160 * 60','쿠션 55*55','매쉬 의자'
    }

    brand_names = {
        '레이튼', '로하스', '흄', '리스너', '베아', '차우', '무치', '유니버스', '노아', '키텐', '페어리', '게이트', '오픈도어스', '슈가', '델린', '티코스', '시저', '빈', '제나',
        '퓨린', '씨네', '케이트', '본아페티', '커트넥', '버드', '린스토리', '타이', '유스페이스', '피어스', '치트타임', '나이트헌트', '미스틱', '누들링', '트라이', '엑스', '네임드',
        '무브', '어라운드', '북스토어', '맨파워', '애니웨이', '시퀀스', '캑터스', '앵커', '베이직파워', '네이비', '와이유씨', '퍼플유저', '보브', '마운틴', '쓰리윈도', '핸들',
        '뷰티풀페인트', '로프', '차일디쉬', '이노쉐이드', '룬', '세컨', '이솝', '스마일', '푸름', '헤라', '체어스', '플레임', '리디', '코멧', '시즈니', '워터폴', '브이아이', '리빙', '핑거스',
        '선플라워', '메이플', '링크스페이스', '베얼리', '드림타워', '플레이온', '데톨', '맨숀', '레나치오', '퍼포먼스', '투웨이',
        '아이콘', '신사', '호크', '윈드밀', '터틀', '레이', '캐스트', '피노키오', '벤자민', '다이브', '칙스', '케이퍼', '오아르',
        '넘버원', '위켄드', '큐시티', '롱프라이데이', '모토'
                   }

    def generate(self, n=100, separator=''):
        result = set()
        # print(postfixs)
        cnt = 0
        while len(result) < n:
            prefix = list(self.prefixs)[randrange(len(self.prefixs))]
            postfix = list(self.postfixs)[randrange(len(self.postfixs))]
            result.add(f'{prefix}{separator}{postfix}')
            cnt += 1
        print('try:', cnt)
        return result

    def generate_employee_name(self, n=100):
        self.prefixs = self.last_name
        self.postfixs = self.first_name
        names = self.generate(n)
        return self.append_position(names)

    def generate_korean_name(self, n=100):
        self.prefixs = self.last_name
        self.postfixs = self.first_name
        names = self.generate(n)
        return names

    def generate_company_name(self, n=100):
        return self.generate(n)

    def append_position(self, names):
        positions = ['사원'] * 5 + ['주임'] * 6 + ['대리'] * 7 + ['과장'] * 6 + ['차장'] * 3 + ['부장'] * 2 + ['이사'] * 1
        r = []
        for name in names:
            r.append(f'{name} {positions[randrange(len(positions))]}')
        return r

    def generate_product_name(self, n=100):
        self.prefixs = self.brand_names
        self.postfixs = self.product_names
        names = self.generate(n, ' ')
        return names

    def phone_numbers(self, n=100):
        result = set()
        # print(postfixs)
        cnt = 0
        while len(result) < n:
            result.add(f'{"010"}-{randrange(1000, 9999)}-{randrange(1000, 9999)}')
            cnt += 1
        return result

if __name__ == '__main__':
    ng = NameGenerator()
    company_names = ng.generate_company_name()
    user_names = ng.generate_employee_name()
    product_names = ng.generate_product_name()
    names = ng.generate_korean_name()
    phone_numbers = ng.phone_numbers()

    li = phone_numbers
    for item in li:
        print(item)
